dylanwsmith/HOSS-Rover/Core Files/LPC1768regmap.h
/*
 * AUTHOR:        Alec Selfridge
 * VERSION:       1.1
 * DATE CREATED:  10/22/2016
 * LAST MODIFIED: 02/03/2017
 * NOTES:         This is an exhaustive list of all the registers found in
 *                the LPC1768. Due to common names, double-check the register
 *                names for Ethernet & RTC peripherals if used. Half-word
 *                registers are not included.
 */
#ifndef __LPC1768regmap_H
#define __LPC1768regmap_H

/**************System Control**************/
// External Interrupt Registers
#define EXTINT   (*(volatile unsigned int*)0x400FC140)
#define EXTMODE  (*(volatile unsigned int*)0x400FC148)
#define EXTPOLAR (*(volatile unsigned int*)0x400FC14C)
// Reset
#define RSID (*(volatile unsigned int*)0x400FC180)
// Syscon Misc Registers
#define SCS (*(volatile unsigned int*)0x400FC1A0)

/**************Clock Source Selection**************/
// Clock Source Select Register
#define CLKSRCSEL (*(volatile unsigned int*)0x400FC10C)
	
/**************Phase Locked Loop**************/
// Main PLL
#define PLL0CON  (*(volatile unsigned int*)0x400FC080)
#define PLL0CFG  (*(volatile unsigned int*)0x400FC084)
#define PLL0STAT (*(volatile unsigned int*)0x400FC088)
#define PLL0FEED (*(volatile unsigned int*)0x400FC08C)
// USB PLL
#define PLL1CON  (*(volatile unsigned int*)0x400FC0A0)
#define PLL1CFG  (*(volatile unsigned int*)0x400FC0A4)
#define PLL1STAT (*(volatile unsigned int*)0x400FC0A8)
#define PLL1FEED (*(volatile unsigned int*)0x400FC0AC)
// Clock Dividers
#define CCLKCFG   (*(volatile unsigned int*)0x400FC104)
#define USBCLKCFG (*(volatile unsigned int*)0x400FC108)
#define PCLKSEL0  (*(volatile unsigned int*)0x400FC1A8)
#define PCLKSEL1  (*(volatile unsigned int*)0x400FC1AC)
// Power Control
#define PCON  (*(volatile unsigned int*)0x400FC0C0)
#define PCONP (*(volatile unsigned int*)0x400FC0C4)
// Utility
#define CLKOUTCFG (*(volatile unsigned int*)0x400FC1C8)

/**************Flash Accelerator**************/
// Flash Accelerator Configuration Register
#define FLASHCFG (*(volatile unsigned int*)0x400FC000)

/**************NVIC**************/
// Interrupt Set-Enable Registers
#define ISER0 (*(volatile unsigned int*)0xE000E100)
#define ISER1 (*(volatile unsigned int*)0xE000E104)
// Interrupt Clear-Enable Registers
#define ICER0 (*(volatile unsigned int*)0xE000E180)
#define ICER1 (*(volatile unsigned int*)0xE000E184)
// Interrupt Set-Pending Registers
#define ISPR0 (*(volatile unsigned int*)0xE000E200)
#define ISPR1 (*(volatile unsigned int*)0xE000E204)
// Interrupt Clear-Pending Registers
#define ICPR0 (*(volatile unsigned int*)0xE000E280)
#define ICPR1 (*(volatile unsigned int*)0xE000E284)
// Interrupt Active Bit Registers
#define IABR0 (*(volatile unsigned int*)0xE000E300)
#define IABR1 (*(volatile unsigned int*)0xE000E304)
// Interrupt Priority Registers
#define IPR0 (*(volatile unsigned int*)0xE000E400)
#define IPR1 (*(volatile unsigned int*)0xE000E404)
#define IPR2 (*(volatile unsigned int*)0xE000E408)
#define IPR3 (*(volatile unsigned int*)0xE000E40C)
#define IPR4 (*(volatile unsigned int*)0xE000E410)
#define IPR5 (*(volatile unsigned int*)0xE000E414)
#define IPR6 (*(volatile unsigned int*)0xE000E418)
#define IPR7 (*(volatile unsigned int*)0xE000E41C)
#define IPR8 (*(volatile unsigned int*)0xE000E420)
// Software Trigger Interrupt Register
#define STIR (*(volatile unsigned int*)0xE000EF00)

/**************Pin Control**************/
// Pin Select Registers
#define PINSEL0  (*(volatile unsigned int*)0x4002C000)
#define PINSEL1  (*(volatile unsigned int*)0x4002C004)
#define PINSEL2  (*(volatile unsigned int*)0x4002C008)
#define PINSEL3  (*(volatile unsigned int*)0x4002C00C)
#define PINSEL4  (*(volatile unsigned int*)0x4002C010)
#define PINSEL7  (*(volatile unsigned int*)0x4002C01C)
#define PINSEL8  (*(volatile unsigned int*)0x4002C020)
#define PINSEL9  (*(volatile unsigned int*)0x4002C024)
#define PINSEL10 (*(volatile unsigned int*)0x4002C028)
// Pin Mode Registers
#define PINMODE0 (*(volatile unsigned int*)0x4002C040)
#define PINMODE1 (*(volatile unsigned int*)0x4002C044)
#define PINMODE2 (*(volatile unsigned int*)0x4002C048)
#define PINMODE3 (*(volatile unsigned int*)0x4002C04C)
#define PINMODE4 (*(volatile unsigned int*)0x4002C050)
#define PINMODE5 (*(volatile unsigned int*)0x4002C054)
#define PINMODE6 (*(volatile unsigned int*)0x4002C058)
#define PINMODE7 (*(volatile unsigned int*)0x4002C05C)
#define PINMODE9 (*(volatile unsigned int*)0x4002C064)
// Open Drain Mode Control Registers
#define PINMODE_OD0 (*(volatile unsigned int*)0x4002C068)
#define PINMODE_OD1 (*(volatile unsigned int*)0x4002C06C)
#define PINMODE_OD2 (*(volatile unsigned int*)0x4002C070)
#define PINMODE_OD3 (*(volatile unsigned int*)0x4002C074)
#define PINMODE_OD4 (*(volatile unsigned int*)0x4002C078)
// I2C Pin Configuration Register
#define I2CPADCFG (*(volatile unsigned int*)0x4002C07C)
	
/**************GPIO**************/
// Direction Control Registers
#define FIO0DIR0 (*(volatile unsigned int*)0x2009C000)
#define FIO1DIR0 (*(volatile unsigned int*)0x2009C020)
#define FIO2DIR0 (*(volatile unsigned int*)0x2009C040)
#define FIO3DIR0 (*(volatile unsigned int*)0x2009C060)
#define FIO4DIR0 (*(volatile unsigned int*)0x2009C080)
#define FIO0DIR1 (*(volatile unsigned int*)0x2009C001)
#define FIO1DIR1 (*(volatile unsigned int*)0x2009C021)
#define FIO2DIR1 (*(volatile unsigned int*)0x2009C041)
#define FIO3DIR1 (*(volatile unsigned int*)0x2009C061)
#define FIO4DIR1 (*(volatile unsigned int*)0x2009C081)
#define FIO0DIR2 (*(volatile unsigned int*)0x2009C002)
#define FIO1DIR2 (*(volatile unsigned int*)0x2009C022)
#define FIO2DIR2 (*(volatile unsigned int*)0x2009C042)
#define FIO3DIR2 (*(volatile unsigned int*)0x2009C062)
#define FIO4DIR2 (*(volatile unsigned int*)0x2009C082)
#define FIO0DIR3 (*(volatile unsigned int*)0x2009C003)
#define FIO1DIR3 (*(volatile unsigned int*)0x2009C023)
#define FIO2DIR3 (*(volatile unsigned int*)0x2009C043)
#define FIO3DIR3 (*(volatile unsigned int*)0x2009C063)
#define FIO4DIR3 (*(volatile unsigned int*)0x2009C083)
// Mask Registers
#define FIO0MASK0 (*(volatile unsigned int*)0x2009C010)	
#define FIO1MASK0 (*(volatile unsigned int*)0x2009C030)
#define FIO2MASK0 (*(volatile unsigned int*)0x2009C050)
#define FIO3MASK0 (*(volatile unsigned int*)0x2009C070)
#define FIO4MASK0 (*(volatile unsigned int*)0x2009C090)
#define FIO0MASK1 (*(volatile unsigned int*)0x2009C011)	
#define FIO1MASK1 (*(volatile unsigned int*)0x2009C031)
#define FIO2MASK1 (*(volatile unsigned int*)0x2009C051)
#define FIO3MASK1 (*(volatile unsigned int*)0x2009C071)
#define FIO4MASK1 (*(volatile unsigned int*)0x2009C091)
#define FIO0MASK2 (*(volatile unsigned int*)0x2009C012)	
#define FIO1MASK2 (*(volatile unsigned int*)0x2009C032)
#define FIO2MASK2 (*(volatile unsigned int*)0x2009C052)
#define FIO3MASK2 (*(volatile unsigned int*)0x2009C072)
#define FIO4MASK2 (*(volatile unsigned int*)0x2009C092)
#define FIO0MASK3 (*(volatile unsigned int*)0x2009C013)	
#define FIO1MASK3 (*(volatile unsigned int*)0x2009C033)
#define FIO2MASK3 (*(volatile unsigned int*)0x2009C053)
#define FIO3MASK3 (*(volatile unsigned int*)0x2009C073)
#define FIO4MASK3 (*(volatile unsigned int*)0x2009C093)
// Pin Value Registers
#define FIO0PIN0 (*(volatile unsigned int*)0x2009C014)
#define FIO1PIN0 (*(volatile unsigned int*)0x2009C034)
#define FIO2PIN0 (*(volatile unsigned int*)0x2009C054)
#define FIO3PIN0 (*(volatile unsigned int*)0x2009C074)
#define FIO4PIN0 (*(volatile unsigned int*)0x2009C094)
#define FIO0PIN1 (*(volatile unsigned int*)0x2009C015)
#define FIO1PIN1 (*(volatile unsigned int*)0x2009C035)
#define FIO2PIN1 (*(volatile unsigned int*)0x2009C055)
#define FIO3PIN1 (*(volatile unsigned int*)0x2009C075)
#define FIO4PIN1 (*(volatile unsigned int*)0x2009C095)
#define FIO0PIN2 (*(volatile unsigned int*)0x2009C016)
#define FIO1PIN2 (*(volatile unsigned int*)0x2009C036)
#define FIO2PIN2 (*(volatile unsigned int*)0x2009C056)
#define FIO3PIN2 (*(volatile unsigned int*)0x2009C076)
#define FIO4PIN2 (*(volatile unsigned int*)0x2009C096)
#define FIO0PIN3 (*(volatile unsigned int*)0x2009C017)
#define FIO1PIN3 (*(volatile unsigned int*)0x2009C037)
#define FIO2PIN3 (*(volatile unsigned int*)0x2009C057)
#define FIO3PIN3 (*(volatile unsigned int*)0x2009C077)
#define FIO4PIN3 (*(volatile unsigned int*)0x2009C097)
// Output Set Registers
#define FIO0SET0 (*(volatile unsigned int*)0x2009C018)
#define FIO1SET0 (*(volatile unsigned int*)0x2009C038)
#define FIO2SET0 (*(volatile unsigned int*)0x2009C058)
#define FIO3SET0 (*(volatile unsigned int*)0x2009C078)
#define FIO4SET0 (*(volatile unsigned int*)0x2009C098)
#define FIO0SET1 (*(volatile unsigned int*)0x2009C019)
#define FIO1SET1 (*(volatile unsigned int*)0x2009C039)
#define FIO2SET1 (*(volatile unsigned int*)0x2009C059)
#define FIO3SET1 (*(volatile unsigned int*)0x2009C079)
#define FIO4SET1 (*(volatile unsigned int*)0x2009C099)
#define FIO0SET2 (*(volatile unsigned int*)0x2009C01A)
#define FIO1SET2 (*(volatile unsigned int*)0x2009C03A)
#define FIO2SET2 (*(volatile unsigned int*)0x2009C05A)
#define FIO3SET2 (*(volatile unsigned int*)0x2009C07A)
#define FIO4SET2 (*(volatile unsigned int*)0x2009C09A)
#define FIO0SET3 (*(volatile unsigned int*)0x2009C01B)
#define FIO1SET3 (*(volatile unsigned int*)0x2009C03B)
#define FIO2SET3 (*(volatile unsigned int*)0x2009C05B)
#define FIO3SET3 (*(volatile unsigned int*)0x2009C07B)
#define FIO4SET3 (*(volatile unsigned int*)0x2009C09B)
// Output Clear Registers
#define FIO0CLR0 (*(volatile unsigned int*)0x2009C01C)
#define FIO1CLR0 (*(volatile unsigned int*)0x2009C03C)
#define FIO2CLR0 (*(volatile unsigned int*)0x2009C05C)
#define FIO3CLR0 (*(volatile unsigned int*)0x2009C07C)
#define FIO4CLR0 (*(volatile unsigned int*)0x2009C09C)
#define FIO0CLR1 (*(volatile unsigned int*)0x2009C01D)
#define FIO1CLR1 (*(volatile unsigned int*)0x2009C03D)
#define FIO2CLR1 (*(volatile unsigned int*)0x2009C05D)
#define FIO3CLR1 (*(volatile unsigned int*)0x2009C07D)
#define FIO4CLR1 (*(volatile unsigned int*)0x2009C09D)
#define FIO0CLR2 (*(volatile unsigned int*)0x2009C01E)
#define FIO1CLR2 (*(volatile unsigned int*)0x2009C03E)
#define FIO2CLR2 (*(volatile unsigned int*)0x2009C05E)
#define FIO3CLR2 (*(volatile unsigned int*)0x2009C07E)
#define FIO4CLR2 (*(volatile unsigned int*)0x2009C09E)
#define FIO0CLR3 (*(volatile unsigned int*)0x2009C01F)
#define FIO1CLR3 (*(volatile unsigned int*)0x2009C03F)
#define FIO2CLR3 (*(volatile unsigned int*)0x2009C05F)
#define FIO3CLR3 (*(volatile unsigned int*)0x2009C07F)
#define FIO4CLR3 (*(volatile unsigned int*)0x2009C09F)
// Interrupt Registers
#define IO0INTENR   (*(volatile unsigned int*)0x40028090)
#define IO2INTENR   (*(volatile unsigned int*)0x400280B0)
#define IO0INTENF   (*(volatile unsigned int*)0x40028094)
#define IO2INTENF   (*(volatile unsigned int*)0x400280B4)
#define IO0STATR    (*(volatile unsigned int*)0x40028084)
#define IO2STATR    (*(volatile unsigned int*)0x400280A4)
#define IO0STATF    (*(volatile unsigned int*)0x40028088)
#define IO2STATF    (*(volatile unsigned int*)0x400280A8)
#define IO0INTCLR   (*(volatile unsigned int*)0x4002808C)
#define IO2INTCLR   (*(volatile unsigned int*)0x400280AC)
#define IOINTSTATUS (*(volatile unsigned int*)0x40028080)

/**************Ethernet**************/
// MAC Registers
#define MAC1 (*(volatile unsigned int*)0x50000000)
#define MAC2 (*(volatile unsigned int*)0x50000004)
#define IPGT (*(volatile unsigned int*)0x50000008)
#define IPGR (*(volatile unsigned int*)0x5000000C)
#define CLRT (*(volatile unsigned int*)0x50000010)
#define MAXF (*(volatile unsigned int*)0x50000014)
#define SUPP (*(volatile unsigned int*)0x50000018)
#define TEST (*(volatile unsigned int*)0x5000001C)
#define MCFG (*(volatile unsigned int*)0x50000020)
#define MCMD (*(volatile unsigned int*)0x50000024)
#define MADR (*(volatile unsigned int*)0x50000028)
#define MWTD (*(volatile unsigned int*)0x5000002C)
#define MRDD (*(volatile unsigned int*)0x50000030)
#define MIND (*(volatile unsigned int*)0x50000034)
#define SA0  (*(volatile unsigned int*)0x50000040)
#define SA1  (*(volatile unsigned int*)0x50000044)
#define SA2  (*(volatile unsigned int*)0x50000048)
// Control Registers
#define ETHCOMMAND         (*(volatile unsigned int*)0x50000100)
#define ETHSTATUS          (*(volatile unsigned int*)0x50000104)
#define RXDESCRIPTOR       (*(volatile unsigned int*)0x50000108)
#define RXSTATUS           (*(volatile unsigned int*)0x5000010C)
#define RXDESCRIPTORNUMBER (*(volatile unsigned int*)0x50000110)
#define RXPRODUCEINDEX     (*(volatile unsigned int*)0x50000114)
#define RXCONSUMEINDEX     (*(volatile unsigned int*)0x50000118)
#define TXDESCRIPTOR       (*(volatile unsigned int*)0x5000011C)
#define TXSTATUS           (*(volatile unsigned int*)0x50000120)
#define TXDESCRIPTORNUMBER (*(volatile unsigned int*)0x50000124)
#define TXPRODUCEINDEX     (*(volatile unsigned int*)0x50000128)
#define TXCONSUMEINDEX     (*(volatile unsigned int*)0x5000012C)
#define TSV0               (*(volatile unsigned int*)0x50000158)
#define TSV1               (*(volatile unsigned int*)0x5000015C)
#define RSV                (*(volatile unsigned int*)0x50000160)
#define FLOWCONTROLCOUNTER (*(volatile unsigned int*)0x50000170)
#define FLOWCONTROLSTATUS  (*(volatile unsigned int*)0x50000174)
// Rx Filter Registers
#define RXFILTERCTRL      (*(volatile unsigned int*)0x50000200)
#define RXFILTERWOLSTATUS (*(volatile unsigned int*)0x50000204)
#define RXFILTERWOLCLEAR  (*(volatile unsigned int*)0x50000208)
#define HASHFILTERL       (*(volatile unsigned int*)0x50000210)
#define HASHFILTERH       (*(volatile unsigned int*)0x50000214)
// Module Control Registers
#define INTSTATUS (*(volatile unsigned int*)0x50000FE0)
#define INTENABLE (*(volatile unsigned int*)0x50000FE4)
#define INTCLEAR  (*(volatile unsigned int*)0x50000FE8)
#define INTSET    (*(volatile unsigned int*)0x50000FEC)
#define POWERDOWN (*(volatile unsigned int*)0x50000FF4)

/**************USB Device Controller**************/
// Clock Control Registers
#define USBCLKCTRL (*(volatile unsigned int*)0x5000CFF4)
#define USBCLKST   (*(volatile unsigned int*)0x5000CFF8)
// Device Interrupt Registers
#define USBINTST     (*(volatile unsigned int*)0x400FC1C0)
#define USBDEVINTST  (*(volatile unsigned int*)0x5000C200)
#define USBDEVINTEN  (*(volatile unsigned int*)0x5000C204)
#define USBDEVINTCLR (*(volatile unsigned int*)0x5000C208)
#define USBDEVINTSET (*(volatile unsigned int*)0x5000C20C)
#define USBDEVINTPRI (*(volatile unsigned int*)0x5000C22C)
// Endpoint Interrupt Registers
#define USBEPINTST  (*(volatile unsigned int*)0x5000C230)
#define USBEPINTEN  (*(volatile unsigned int*)0x5000C234)
#define USBEPINTCLR (*(volatile unsigned int*)0x5000C238)
#define USBEPINTSET (*(volatile unsigned int*)0x5000C23C)
#define USBEPINTPRI (*(volatile unsigned int*)0x5000C240)
// Endpoint Realization Registers
#define USBREEP     (*(volatile unsigned int*)0x5000C244)
#define USBEPIN     (*(volatile unsigned int*)0x5000C248)
#define USBMAXPSIZE (*(volatile unsigned int*)0x5000C24C)
// USB Transfer Registers
#define USBRXDATA (*(volatile unsigned int*)0x5000C218)
#define USBRXPLEN (*(volatile unsigned int*)0x5000C220)
#define USBTXDATA (*(volatile unsigned int*)0x5000C21C)
#define USBTXPLEN (*(volatile unsigned int*)0x5000C224)
#define USBCTRL   (*(volatile unsigned int*)0x5000C228)
// SIE Command Registers
#define USBCMDCODE (*(volatile unsigned int*)0x5000C210)
#define USBCMDDATA (*(volatile unsigned int*)0x5000C214)
// DMA Registers
#define USBDMARST       (*(volatile unsigned int*)0x5000C250)
#define USBDMARCLR      (*(volatile unsigned int*)0x5000C254)
#define USBDMARSET      (*(volatile unsigned int*)0x5000C258)
#define USBUDCAH        (*(volatile unsigned int*)0x5000C280)
#define USBEPDMAST      (*(volatile unsigned int*)0x5000C284)
#define USBEPDMAEN      (*(volatile unsigned int*)0x5000C288)
#define USBEPDMADIS     (*(volatile unsigned int*)0x5000C28C)
#define USBDMAINTST     (*(volatile unsigned int*)0x5000C290)
#define USBDMAINTEN     (*(volatile unsigned int*)0x5000C294)
#define USBEOTINTST     (*(volatile unsigned int*)0x5000C2A0)
#define USBEOTINTCLR    (*(volatile unsigned int*)0x5000C2A4)
#define USBEOTINTSET    (*(volatile unsigned int*)0x5000C2A8)
#define USBNDDRINTST    (*(volatile unsigned int*)0x5000C2AC)
#define USBNDDRINTCLR   (*(volatile unsigned int*)0x5000C2B0)
#define USBNDDRINTSET   (*(volatile unsigned int*)0x5000C2B4)
#define USBSYSERRINTST  (*(volatile unsigned int*)0x5000C2B8)
#define USBSYSERRINTCLR (*(volatile unsigned int*)0x5000C2BC)
#define USBSYSERRINTSET (*(volatile unsigned int*)0x5000C2C0)

/**************USB Host Controller**************/
#define HCREVISION         (*(volatile unsigned int*)0x5000C000)
#define HCCONTROL          (*(volatile unsigned int*)0x5000C004)
#define HCCOMMANDSTATUS    (*(volatile unsigned int*)0x5000C008)
#define HCINTERRUPTSTATUS  (*(volatile unsigned int*)0x5000C00C)
#define HCINTERRUPTENABLE  (*(volatile unsigned int*)0x5000C010)
#define HCINTERRUPTDISABLE (*(volatile unsigned int*)0x5000C014)
#define HCHCCA             (*(volatile unsigned int*)0x5000C018)
#define HCPERIODCURRENTED  (*(volatile unsigned int*)0x5000C01C)
#define HCCONTROLHEADED    (*(volatile unsigned int*)0x5000C020)
#define HCCONTROLCURRENTED (*(volatile unsigned int*)0x5000C024)
#define HCBULKHEADED       (*(volatile unsigned int*)0x5000C028)
#define HCBULKCURRENTED    (*(volatile unsigned int*)0x5000C02C)
#define HCDONEHEAD         (*(volatile unsigned int*)0x5000C030)
#define HCFMINTERVAL       (*(volatile unsigned int*)0x5000C034)
#define HCFMREMAINING      (*(volatile unsigned int*)0x5000C038)
#define HCFMNUMBER         (*(volatile unsigned int*)0x5000C03C)
#define HCPERIODICSTART    (*(volatile unsigned int*)0x5000C040)
#define HCLSTHRESHOLD      (*(volatile unsigned int*)0x5000C044)
#define HCRHDESCRIPTORA    (*(volatile unsigned int*)0x5000C048)
#define HCRHDESCRIPTORB    (*(volatile unsigned int*)0x5000C04C)
#define HCRHSTATUS         (*(volatile unsigned int*)0x5000C050)
#define HCRHPORTSTATUS1    (*(volatile unsigned int*)0x5000C054)
#define HCRHPORTSTATUS2    (*(volatile unsigned int*)0x5000C058)
#define MODULEIDVERREVID   (*(volatile unsigned int*)0x5000C0FC)

/**************USB OTG**************/
// Interrupt Register
#define USBINTST (*(volatile unsigned int*)0x400FC1C0)
// OTG Registers
#define OTGINTST  (*(volatile unsigned int*)0x5000C100)
#define OTGINTEN  (*(volatile unsigned int*)0x5000C104)
#define OTGINTSET (*(volatile unsigned int*)0x5000C108)
#define OTGINTCLR (*(volatile unsigned int*)0x5000C10C)
#define OTGSTCTRL (*(volatile unsigned int*)0x5000C110)
#define OTGTMR    (*(volatile unsigned int*)0x5000C114)
// I2C Registers
#define I2CRX    (*(volatile unsigned int*)0x5000C300)
#define I2CTX    (*(volatile unsigned int*)0x5000C300)
#define I2CSTS   (*(volatile unsigned int*)0x5000C304)
#define I2CCTL   (*(volatile unsigned int*)0x5000C308)
#define I2CCLKHI (*(volatile unsigned int*)0x5000C30C)
#define I2CCLKLO (*(volatile unsigned int*)0x5000C310)
// Clock Control Registers
#define OTGCLKCTRL (*(volatile unsigned int*)0x5000CFF4)
#define OTGCLKST   (*(volatile unsigned int*)0x5000CFF8)

/**************UART**************/
// Receive Buffer Registers
#define U0RBR (*(volatile unsigned int*)0x4000C000)
#define U1RBR (*(volatile unsigned int*)0x40010000)
#define U2RBR (*(volatile unsigned int*)0x40098000)
#define U3RBR (*(volatile unsigned int*)0x4009C000)
// Transmit Holding Registers
#define U0THR (*(volatile unsigned int*)0x4000C000)
#define U1THR (*(volatile unsigned int*)0x40010000)
#define U2THR (*(volatile unsigned int*)0x40098000)
#define U3THR (*(volatile unsigned int*)0x4009C000)
// Divisor Latch LSB
#define U0DLL (*(volatile unsigned int*)0x4000C000)
#define U1DLL (*(volatile unsigned int*)0x40010000)
#define U2DLL (*(volatile unsigned int*)0x40098000)
#define U3DLL (*(volatile unsigned int*)0x4009C000)
// Divisor Latch MSB
#define U0DLM (*(volatile unsigned int*)0x4000C004)
#define U1DLM (*(volatile unsigned int*)0x40010004)
#define U2DLM (*(volatile unsigned int*)0x40098004)
#define U3DLM (*(volatile unsigned int*)0x4009C004)
// Interrupt Enable Registers
#define U0IER (*(volatile unsigned int*)0x4000C004)
#define U1IER (*(volatile unsigned int*)0x40010004)
#define U2IER (*(volatile unsigned int*)0x40098004)
#define U3IER (*(volatile unsigned int*)0x4009C004)
// Interrupt ID Registers
#define U0IIR (*(volatile unsigned int*)0x4000C008)
#define U1IIR (*(volatile unsigned int*)0x40010008)
#define U2IIR (*(volatile unsigned int*)0x40098008)
#define U3IIR (*(volatile unsigned int*)0x4009C008)
// FIFO Control Registers
#define U0FCR (*(volatile unsigned int*)0x4000C008)
#define U1FCR (*(volatile unsigned int*)0x40010008)
#define U2FCR (*(volatile unsigned int*)0x40098008)
#define U3FCR (*(volatile unsigned int*)0x4009C008)
// Line Control Registers
#define U0LCR (*(volatile unsigned int*)0x4000C00C)
#define U1LCR (*(volatile unsigned int*)0x4001000C)
#define U2LCR (*(volatile unsigned int*)0x4009800C)
#define U3LCR (*(volatile unsigned int*)0x4009C00C)
// Line Status Registers
#define U0LSR (*(volatile unsigned int*)0x4000C014)
#define U1LSR (*(volatile unsigned int*)0x40010014)
#define U2LSR (*(volatile unsigned int*)0x40098014)
#define U3LSR (*(volatile unsigned int*)0x4009C014)
// Scratch Pad Register
#define U0SCR (*(volatile unsigned int*)0x4000C01C)
#define U1SCR (*(volatile unsigned int*)0x4001001C)
#define U2SCR (*(volatile unsigned int*)0x4009801C)
#define U3SCR (*(volatile unsigned int*)0x4009C01C)
// Auto-baud Control Registers
#define U0ACR (*(volatile unsigned int*)0x4000C020)
#define U1ACR (*(volatile unsigned int*)0x40010020)
#define U2ACR (*(volatile unsigned int*)0x40098020)
#define U3ACR (*(volatile unsigned int*)0x4009C020)
// IRDA Control Register
#define U0ICR (*(volatile unsigned int*)0x4000C024)
#define U2ICR (*(volatile unsigned int*)0x40098024)
#define U3ICR (*(volatile unsigned int*)0x4009C024)
// Fractional Divider Register
#define U0FDR (*(volatile unsigned int*)0x4000C028)
#define U1FDR (*(volatile unsigned int*)0x40010028)
#define U2FDR (*(volatile unsigned int*)0x40098028)
#define U3FDR (*(volatile unsigned int*)0x4009C028)
// Transmit Enable Register
#define U0TER (*(volatile unsigned int*)0x4000C030)
#define U1TER (*(volatile unsigned int*)0x40010030)
#define U2TER (*(volatile unsigned int*)0x40098030)
#define U3TER (*(volatile unsigned int*)0x4009C030)
// Modem Registers
#define U1MCR (*(volatile unsigned int*)0x40010010)
#define U1MSR (*(volatile unsigned int*)0x40010018)
// RS-485/EIA-485 Registers
#define U1RS485CTRL  (*(volatile unsigned int*)0x4001004C)
#define U1RS485MATCH (*(volatile unsigned int*)0x40010050)
#define U1RS485DLY   (*(volatile unsigned int*)0x40010054)

