dylanwsmith/HOSS-Rover/Core Files/LPC1768regmap.h
/**************CAN**************/
// Acceptance Filter and Central CAN Registers
#define AFMR       (*(volatile unsigned int*)0x4003C000)
#define SFFSA      (*(volatile unsigned int*)0x4003C004)
#define SFFGRPSA   (*(volatile unsigned int*)0x4003C008)
#define EFFSA      (*(volatile unsigned int*)0x4003C00C)
#define EFFGRPSA   (*(volatile unsigned int*)0x4003C010)
#define ENDOFTABLE (*(volatile unsigned int*)0x4003C014)
#define LUTERRAD   (*(volatile unsigned int*)0x4003C018)
#define LUTERR     (*(volatile unsigned int*)0x4003C01C)
#define CANTXSR    (*(volatile unsigned int*)0x40040000)
#define CANRXSR    (*(volatile unsigned int*)0x40040004)
#define CANMSR     (*(volatile unsigned int*)0x40040008)
// CAN1/2 Control Registers
#define CAN1MOD  (*(volatile unsigned int*)0x40044000)
#define CAN2MOD  (*(volatile unsigned int*)0x40048000)
#define CAN1CMR  (*(volatile unsigned int*)0x40044004)
#define CAN2CMR  (*(volatile unsigned int*)0x40048004)
#define CAN1GSR  (*(volatile unsigned int*)0x40044008)
#define CAN2GSR  (*(volatile unsigned int*)0x40048008)
#define CAN1ICR  (*(volatile unsigned int*)0x4004400C)
#define CAN2ICR  (*(volatile unsigned int*)0x4004800C)
#define CAN1IER  (*(volatile unsigned int*)0x40044010)
#define CAN2IER  (*(volatile unsigned int*)0x40048010)
#define CAN1BTR  (*(volatile unsigned int*)0x40044014)
#define CAN2BTR  (*(volatile unsigned int*)0x40048014)
#define CAN1EWL  (*(volatile unsigned int*)0x40044018)
#define CAN2EWL  (*(volatile unsigned int*)0x40048018)
#define CAN1SR   (*(volatile unsigned int*)0x4004401C)
#define CAN2SR   (*(volatile unsigned int*)0x4004801C)
#define CAN1RFS  (*(volatile unsigned int*)0x40044020)
#define CAN2RFS  (*(volatile unsigned int*)0x40048020)
#define CAN1RID  (*(volatile unsigned int*)0x40044024)
#define CAN2RID  (*(volatile unsigned int*)0x40048024)
#define CAN1RDA  (*(volatile unsigned int*)0x40044028)
#define CAN2RDA  (*(volatile unsigned int*)0x40048028)
#define CAN1RDB  (*(volatile unsigned int*)0x4004402C)
#define CAN2RDB  (*(volatile unsigned int*)0x4004802C)
#define CAN1TFI1 (*(volatile unsigned int*)0x40044030)
#define CAN2TFI1 (*(volatile unsigned int*)0x40048030)
#define CAN1TID1 (*(volatile unsigned int*)0x40044034)
#define CAN2TID1 (*(volatile unsigned int*)0x40048034)
#define CAN1TDA1 (*(volatile unsigned int*)0x40044038)
#define CAN2TDA1 (*(volatile unsigned int*)0x40048038)
#define CAN1TDB1 (*(volatile unsigned int*)0x4004403C)
#define CAN2TDB1 (*(volatile unsigned int*)0x4004803C)
#define CAN1TFI2 (*(volatile unsigned int*)0x40044040)
#define CAN2TFI2 (*(volatile unsigned int*)0x40048040)
#define CAN1TID2 (*(volatile unsigned int*)0x40044044)
#define CAN2TID2 (*(volatile unsigned int*)0x40048044)
#define CAN1TDA2 (*(volatile unsigned int*)0x40044048)
#define CAN2TDA2 (*(volatile unsigned int*)0x40048048)
#define CAN1TDB2 (*(volatile unsigned int*)0x4004404C)
#define CAN2TDB2 (*(volatile unsigned int*)0x4004804C)
#define CAN1TFI3 (*(volatile unsigned int*)0x40044050)
#define CAN2TFI3 (*(volatile unsigned int*)0x40048050)
#define CAN1TID3 (*(volatile unsigned int*)0x40044054)
#define CAN2TID3 (*(volatile unsigned int*)0x40048054)
#define CAN1TDA3 (*(volatile unsigned int*)0x40044058)
#define CAN2TDA3 (*(volatile unsigned int*)0x40048058)
#define CAN1TDB3 (*(volatile unsigned int*)0x4004405C)
#define CAN2TDB3 (*(volatile unsigned int*)0x4004805C)

/**************SPI**************/
#define S0SPCR  (*(volatile unsigned int*)0x40020000)
#define S0SPSR  (*(volatile unsigned int*)0x40020004)
#define S0SPDR  (*(volatile unsigned int*)0x40020008)
#define S0SPCCR (*(volatile unsigned int*)0x4002000C)
#define S0SPINT (*(volatile unsigned int*)0x4002001C)

/**************SSP**************/
#define SSP0CR0   (*(volatile unsigned int*)0x40088000)
#define SSP1CR0   (*(volatile unsigned int*)0x40030000)
#define SSP0CR1   (*(volatile unsigned int*)0x40088004)
#define SSP1CR1   (*(volatile unsigned int*)0x40030004)
#define SSP0DR    (*(volatile unsigned int*)0x40088008)
#define SSP1DR    (*(volatile unsigned int*)0x40030008)
#define SSP0SR    (*(volatile unsigned int*)0x4008800C)
#define SSP1SR    (*(volatile unsigned int*)0x4003000C)
#define SSP0CPSR  (*(volatile unsigned int*)0x40088010)
#define SSP1CPSR  (*(volatile unsigned int*)0x40030010)
#define SSP0IMSC  (*(volatile unsigned int*)0x40088014)
#define SSP1IMSC  (*(volatile unsigned int*)0x40030014)
#define SSP0RIS   (*(volatile unsigned int*)0x40088018)
#define SSP1RIS   (*(volatile unsigned int*)0x40030018)
#define SSP0MIS   (*(volatile unsigned int*)0x4008801C)
#define SSP1MIS   (*(volatile unsigned int*)0x4003001C)
#define SSP0ICR   (*(volatile unsigned int*)0x40088020)
#define SSP1ICR   (*(volatile unsigned int*)0x40030020)
#define SSP0DMACR (*(volatile unsigned int*)0x40088024)
#define SSP1DMACR (*(volatile unsigned int*)0x40030024)

/**************I2C**************/
// I2C Control Set Registers
#define I2C0CONSET (*(volatile unsigned int*)0x4001C000)
#define I2C1CONSET (*(volatile unsigned int*)0x4005C000)
#define I2C2CONSET (*(volatile unsigned int*)0x400A0000)
// I2C Status Registers	
#define I2C0STAT (*(volatile unsigned int*)0x4001C004)
#define I2C1STAT (*(volatile unsigned int*)0x4005C004)
#define I2C2STAT (*(volatile unsigned int*)0x400A0004)
// I2C Data Registers
#define I2C0DAT (*(volatile unsigned int*)0x4001C008)
#define I2C1DAT (*(volatile unsigned int*)0x4005C008)
#define I2C2DAT (*(volatile unsigned int*)0x400A0008)
// I2C Slave Address Registers 0
#define I2C0ADR0 (*(volatile unsigned int*)0x4001C00C)
#define I2C1ADR0 (*(volatile unsigned int*)0x4005C00C)
#define I2C2ADR0 (*(volatile unsigned int*)0x400A000C)
// SCH Duty Cycle Registers High
#define I2C0SCLH (*(volatile unsigned int*)0x4001C010)
#define I2C1SCLH (*(volatile unsigned int*)0x4005C010)
#define I2C2SCLH (*(volatile unsigned int*)0x400A0010)
// SCH Duty Cycle Registers Low
#define I2C0SCLL (*(volatile unsigned int*)0x4001C014)
#define I2C1SCLL (*(volatile unsigned int*)0x4005C014)
#define I2C2SCLL (*(volatile unsigned int*)0x400A0014)
// I2C Control Clear Registers
#define I2C0CONCLR (*(volatile unsigned int*)0x4001C018)
#define I2C1CONCLR (*(volatile unsigned int*)0x4005C018)
#define I2C2CONCLR (*(volatile unsigned int*)0x400A0018)
// Monitor Mode Control Registers
#define I2C0MMCTRL (*(volatile unsigned int*)0x4001C01C)
#define I2C1MMCTRL (*(volatile unsigned int*)0x4005C01C)
#define I2C2MMCTRL (*(volatile unsigned int*)0x400A001C)
// I2C Slave Address Registers 1
#define I2C0ADR1 (*(volatile unsigned int*)0x4001C020)
#define I2C1ADR1 (*(volatile unsigned int*)0x4005C020)
#define I2C2ADR1 (*(volatile unsigned int*)0x400A0020)
// I2C Slave Address Registers 2
#define I2C0ADR2 (*(volatile unsigned int*)0x4001C024)
#define I2C1ADR2 (*(volatile unsigned int*)0x4005C024)
#define I2C2ADR2 (*(volatile unsigned int*)0x400A0024)
// I2C Slave Address Registers 3
#define I2C0ADR3 (*(volatile unsigned int*)0x4001C028)
#define I2C1ADR3 (*(volatile unsigned int*)0x4005C028)
#define I2C2ADR3 (*(volatile unsigned int*)0x400A0028)
// Data Buffer Registers
#define I2C0DATABUFFER (*(volatile unsigned int*)0x4001C02C)
#define I2C1DATABUFFER (*(volatile unsigned int*)0x4005C02C)
#define I2C2DATABUFFER (*(volatile unsigned int*)0x400A002C)
// I2C Slave Address Mask Registers 0
#define I2C0MASK0 (*(volatile unsigned int*)0x4001C030)
#define I2C1MASK0 (*(volatile unsigned int*)0x4005C030)
#define I2C2MASK0 (*(volatile unsigned int*)0x400A0030)
// I2C Slave Address Mask Registers 1
#define I2C0MASK1 (*(volatile unsigned int*)0x4001C034)
#define I2C1MASK1 (*(volatile unsigned int*)0x4005C034)
#define I2C2MASK1 (*(volatile unsigned int*)0x400A0034)
// I2C Slave Address Mask Registers 2
#define I2C0MASK2 (*(volatile unsigned int*)0x4001C038)
#define I2C1MASK2 (*(volatile unsigned int*)0x4005C038)
#define I2C2MASK2 (*(volatile unsigned int*)0x400A0038)
// I2C Slave Address Mask Registers 3
#define I2C0MASK3 (*(volatile unsigned int*)0x4001C03C)
#define I2C1MASK3 (*(volatile unsigned int*)0x4005C03C)
#define I2C2MASK3 (*(volatile unsigned int*)0x400A003C)

