dylanwsmith/HOSS-Rover/Core Files/LPC1768regmap.h
/**************I2S**************/
#define I2SDAO       (*(volatile unsigned int*)0x400A8000)
#define I2SDAI       (*(volatile unsigned int*)0x400A8004)
#define I2STXFIFO    (*(volatile unsigned int*)0x400A8008)
#define I2SRXFIFO    (*(volatile unsigned int*)0x400A800C)
#define I2SSTATE     (*(volatile unsigned int*)0x400A8010)
#define I2SDMA1      (*(volatile unsigned int*)0x400A8014)
#define I2SDMA2      (*(volatile unsigned int*)0x400A8018)
#define I2SIRQ       (*(volatile unsigned int*)0x400A801C)
#define I2STXRATE    (*(volatile unsigned int*)0x400A8020)
#define I2SRXRATE    (*(volatile unsigned int*)0x400A8024)
#define I2STXBITRATE (*(volatile unsigned int*)0x400A8028)
#define I2SRXBITRATE (*(volatile unsigned int*)0x400A802C)
#define I2STXMODE    (*(volatile unsigned int*)0x400A8030)
#define I2SRXMODE    (*(volatile unsigned int*)0x400A8034)

/**************Timers/Counters**************/
// Interrupt Registers
#define T0IR (*(volatile unsigned int*)0x40004000)
#define T1IR (*(volatile unsigned int*)0x40008000)
#define T2IR (*(volatile unsigned int*)0x40090000)
#define T3IR (*(volatile unsigned int*)0x40094000)
// Timer Control Registers
#define T0TCR (*(volatile unsigned int*)0x40004004)
#define T1TCR (*(volatile unsigned int*)0x40008004)
#define T2TCR (*(volatile unsigned int*)0x40090004)
#define T3TCR (*(volatile unsigned int*)0x40094004)
// Timer Counters
#define T0TC (*(volatile unsigned int*)0x40004008)
#define T1TC (*(volatile unsigned int*)0x40008008)
#define T2TC (*(volatile unsigned int*)0x40090008)
#define T3TC (*(volatile unsigned int*)0x40094008)
// Prescale Registers
#define T0PR (*(volatile unsigned int*)0x4000400C)
#define T1PR (*(volatile unsigned int*)0x4000800C)
#define T2PR (*(volatile unsigned int*)0x4009000C)
#define T3PR (*(volatile unsigned int*)0x4009400C)
// Prescale Counters
#define T0PC (*(volatile unsigned int*)0x40004010)
#define T1PC (*(volatile unsigned int*)0x40008010)
#define T2PC (*(volatile unsigned int*)0x40090010)
#define T3PC (*(volatile unsigned int*)0x40094010)
// Match Control Registers
#define T0MCR (*(volatile unsigned int*)0x40004014)
#define T1MCR (*(volatile unsigned int*)0x40008014)
#define T2MCR (*(volatile unsigned int*)0x40090014)
#define T3MCR (*(volatile unsigned int*)0x40094014)
// Match Registers 0
#define T0MR0 (*(volatile unsigned int*)0x40004018)
#define T1MR0 (*(volatile unsigned int*)0x40008018)
#define T2MR0 (*(volatile unsigned int*)0x40090018)
#define T3MR0 (*(volatile unsigned int*)0x40094018)
// Match Registers 1
#define T0MR1 (*(volatile unsigned int*)0x4000401C)
#define T1MR1 (*(volatile unsigned int*)0x4000801C)
#define T2MR1 (*(volatile unsigned int*)0x4009001C)
#define T3MR1 (*(volatile unsigned int*)0x4009401C)
// Match Registers 2
#define T0MR2 (*(volatile unsigned int*)0x40004020)
#define T1MR2 (*(volatile unsigned int*)0x40008020)
#define T2MR2 (*(volatile unsigned int*)0x40090020)
#define T3MR2 (*(volatile unsigned int*)0x40094020)
// Match Registers 3
#define T0MR3 (*(volatile unsigned int*)0x40004024)
#define T1MR3 (*(volatile unsigned int*)0x40008024)
#define T2MR3 (*(volatile unsigned int*)0x40090024)
#define T3MR3 (*(volatile unsigned int*)0x40094024)
// Capture Control Registers
#define T0CCR (*(volatile unsigned int*)0x40004028)
#define T1CCR (*(volatile unsigned int*)0x40008028)
#define T2CCR (*(volatile unsigned int*)0x40090028)
#define T3CCR (*(volatile unsigned int*)0x40094028)
// Capture Registers 0
#define T0CR0 (*(volatile unsigned int*)0x4000402C)
#define T1CR0 (*(volatile unsigned int*)0x4000802C)
#define T2CR0 (*(volatile unsigned int*)0x4009002C)
#define T3CR0 (*(volatile unsigned int*)0x4009402C)
// Capture Registers 1
#define T0CR1 (*(volatile unsigned int*)0x40004030)
#define T1CR1 (*(volatile unsigned int*)0x40008030)
#define T2CR1 (*(volatile unsigned int*)0x40090030)
#define T3CR1 (*(volatile unsigned int*)0x40094030)
// External Match Registers
#define T0EMR (*(volatile unsigned int*)0x4000403C)
#define T1EMR (*(volatile unsigned int*)0x4000803C)
#define T2EMR (*(volatile unsigned int*)0x4009003C)
#define T3EMR (*(volatile unsigned int*)0x4009403C)
// Count Control Registers
#define T0CTCR (*(volatile unsigned int*)0x40004070)
#define T1CTCR (*(volatile unsigned int*)0x40008070)
#define T2CTCR (*(volatile unsigned int*)0x40090070)
#define T3CTCR (*(volatile unsigned int*)0x40094070)

/**************RIT**************/
#define RICOMPVAL (*(volatile unsigned int*)0x400B0000)
#define RIMASK    (*(volatile unsigned int*)0x400B0004)
#define RICTRL    (*(volatile unsigned int*)0x400B0008)
#define RICOUNTER (*(volatile unsigned int*)0x400B000C)

/**************System Tick Timer**************/
#define STCTRL   (*(volatile unsigned int*)0xE000E010)
#define STRELOAD (*(volatile unsigned int*)0xE000E014)
#define STCURR   (*(volatile unsigned int*)0xE000E018)
#define STCALIB  (*(volatile unsigned int*)0xE000E01C)

/**************PWM**************/
#define PWM1IR   (*(volatile unsigned int*)0x40018000)
#define PWM1TCR  (*(volatile unsigned int*)0x40018004)
#define PWM1TC   (*(volatile unsigned int*)0x40018008)
#define PWM1PR   (*(volatile unsigned int*)0x4001800C)
#define PWM1PC   (*(volatile unsigned int*)0x40018010)
#define PWM1MCR  (*(volatile unsigned int*)0x40018014)
#define PWM1MR0  (*(volatile unsigned int*)0x40018018)
#define PWM1MR1  (*(volatile unsigned int*)0x4001801C)
#define PWM1MR2  (*(volatile unsigned int*)0x40018020)
#define PWM1MR3  (*(volatile unsigned int*)0x40018024)
#define PWM1CCR  (*(volatile unsigned int*)0x40018028)
#define PWM1CR0  (*(volatile unsigned int*)0x4001802C)
#define PWM1CR1  (*(volatile unsigned int*)0x40018030)
#define PWM1CR2  (*(volatile unsigned int*)0x40018034)
#define PWM1CR3  (*(volatile unsigned int*)0x40018038)
#define PWM1MR4  (*(volatile unsigned int*)0x40018040)
#define PWM1MR5  (*(volatile unsigned int*)0x40018044)
#define PWM1MR6  (*(volatile unsigned int*)0x40018048)
#define PWM1PCR  (*(volatile unsigned int*)0x4001804C)
#define PWM1LER  (*(volatile unsigned int*)0x40018050)
#define PWM1CTCR (*(volatile unsigned int*)0x40018070)

/**************Motor Control PWM**************/
#define MCCON       (*(volatile unsigned int*)0x400B8000)
#define MCCONSET    (*(volatile unsigned int*)0x400B8004)
#define MCCONCLR    (*(volatile unsigned int*)0x400B8008)
#define MCCAPCON    (*(volatile unsigned int*)0x400B800C)
#define MCCAPCONSET (*(volatile unsigned int*)0x400B8010)
#define MCCAPCONCLR (*(volatile unsigned int*)0x400B8014)
#define MCTC0       (*(volatile unsigned int*)0x400B8018)
#define MCTC1       (*(volatile unsigned int*)0x400B801C)
#define MCTC2       (*(volatile unsigned int*)0x400B8020)
#define MCLIM0      (*(volatile unsigned int*)0x400B8024)
#define MCLIM1      (*(volatile unsigned int*)0x400B8028)
#define MCLIM2      (*(volatile unsigned int*)0x400B802C)
#define MCMAT0      (*(volatile unsigned int*)0x400B8030)
#define MCMAT1      (*(volatile unsigned int*)0x400B8034)
#define MCMAT2      (*(volatile unsigned int*)0x400B8038)
#define MCDT        (*(volatile unsigned int*)0x400B803C)
#define MCCP        (*(volatile unsigned int*)0x400B8040)
#define MCCAP0      (*(volatile unsigned int*)0x400B8044)
#define MCCAP1      (*(volatile unsigned int*)0x400B8048)
#define MCCAP2      (*(volatile unsigned int*)0x400B804C)
#define MCINTEN     (*(volatile unsigned int*)0x400B8050)
#define MCINTENSET  (*(volatile unsigned int*)0x400B8054)
#define MCINTENCLR  (*(volatile unsigned int*)0x400B8058)
#define MCCNTCON    (*(volatile unsigned int*)0x400B805C)
#define MCCNTCONSET (*(volatile unsigned int*)0x400B8060)
#define MCCNTCONCLR (*(volatile unsigned int*)0x400B8064)
#define MCINTF      (*(volatile unsigned int*)0x400B8068)
#define MCINTFSET   (*(volatile unsigned int*)0x400B806C)
#define MCINTFCLR   (*(volatile unsigned int*)0x400B8070)
#define MCCAPCLR    (*(volatile unsigned int*)0x400B8074)

/**************Quadrature Encoder**************/
// Control Registers
#define QEICON  (*(volatile unsigned int*)0x400BC000)
#define QEICONF (*(volatile unsigned int*)0x400BC008)
#define QEISTAT (*(volatile unsigned int*)0x400BC004)
//Position, Index, and Timer Registers
#define QEIPOS    (*(volatile unsigned int*)0x400BC00C)
#define QEIMAXPOS (*(volatile unsigned int*)0x400BC010)
#define CMPOS0    (*(volatile unsigned int*)0x400BC014)
#define CMPOS1    (*(volatile unsigned int*)0x400BC018)
#define CMPOS2    (*(volatile unsigned int*)0x400BC01C)
#define INXCNT    (*(volatile unsigned int*)0x400BC020)
#define INXCMP    (*(volatile unsigned int*)0x400BC024)
#define QEILOAD   (*(volatile unsigned int*)0x400BC028)
#define QEITIME   (*(volatile unsigned int*)0x400BC02C)
#define QEIVEL    (*(volatile unsigned int*)0x400BC030)
#define QEICAP    (*(volatile unsigned int*)0x400BC034)
#define VELCOMP   (*(volatile unsigned int*)0x400BC038)
#define FILTER    (*(volatile unsigned int*)0x400BC03C)
// Interrupt Registers
#define QEIINTSTAT (*(volatile unsigned int*)0x400BCFE0)
#define QEISET     (*(volatile unsigned int*)0x400BCFEC)
#define QEICLR     (*(volatile unsigned int*)0x400BCFE8)
#define QEIIE      (*(volatile unsigned int*)0x400BCFE4)
#define QEIIES     (*(volatile unsigned int*)0x400BCFDC)
#define QEIIEC     (*(volatile unsigned int*)0x400BCFD8)

/**************RTC**************/
// Misc Registers
#define ILR      (*(volatile unsigned int*)0x40024000)
#define CCR      (*(volatile unsigned int*)0x40024008)
#define CIIR     (*(volatile unsigned int*)0x4002400C)
#define AMR      (*(volatile unsigned int*)0x40024010)
#define RTCAUX   (*(volatile unsigned int*)0x4002405C)
#define RTCAUXEN (*(volatile unsigned int*)0x40024058)
// Consolidated Time Registers
#define CTIME0 (*(volatile unsigned int*)0x40024014)
#define CTIME1 (*(volatile unsigned int*)0x40024018)
#define CTIME2 (*(volatile unsigned int*)0x4002401C)
// Timer Counter Registers
#define RTCSEC         (*(volatile unsigned int*)0x40024020)
#define RTCMIN         (*(volatile unsigned int*)0x40024024)
#define RTCHOUR        (*(volatile unsigned int*)0x40024028)
#define RTCDOM         (*(volatile unsigned int*)0x4002402C)
#define RTCDOW         (*(volatile unsigned int*)0x40024030)
#define RTCDOY         (*(volatile unsigned int*)0x40024034)
#define RTCMONTH       (*(volatile unsigned int*)0x40024038)
#define RTCYEAR        (*(volatile unsigned int*)0x4002403C)
#define RTCCALIBRATION (*(volatile unsigned int*)0x40024040)
// General Purpose Registers
#define GPREG0 (*(volatile unsigned int*)0x40024044)
#define GPREG1 (*(volatile unsigned int*)0x40024048)
#define GPREG2 (*(volatile unsigned int*)0x4002404C)
#define GPREG3 (*(volatile unsigned int*)0x40024050)
#define GPREG4 (*(volatile unsigned int*)0x40024054)
// Alarm Register Group
#define RTCALSEC  (*(volatile unsigned int*)0x40024060)
#define RTCALMIN  (*(volatile unsigned int*)0x40024064)
#define RTCALHOUR (*(volatile unsigned int*)0x40024068)
#define RTCALDOM  (*(volatile unsigned int*)0x4002406C)
#define RTCALDOW  (*(volatile unsigned int*)0x40024070)
#define RTCALDOY  (*(volatile unsigned int*)0x40024074)
#define RTCALMON  (*(volatile unsigned int*)0x40024078)
#define RTCALYEAR (*(volatile unsigned int*)0x4002407C)

/**************WDT**************/
#define WDMOD    (*(volatile unsigned int*)0x40000000)
#define WDTC     (*(volatile unsigned int*)0x40000004)
#define WDFEED   (*(volatile unsigned int*)0x40000008)
#define WDTV     (*(volatile unsigned int*)0x4000000C)
#define WDCLKSEL (*(volatile unsigned int*)0x40000010)

/**************ADC**************/
#define AD0CR    (*(volatile unsigned int*)0x40034000)
#define AD0GDR   (*(volatile unsigned int*)0x40034004)
#define AD0INTEN (*(volatile unsigned int*)0x4003400C)
#define AD0DR0   (*(volatile unsigned int*)0x40034010)
#define AD0DR1   (*(volatile unsigned int*)0x40034014)
#define AD0DR2   (*(volatile unsigned int*)0x40034018)
#define AD0DR3   (*(volatile unsigned int*)0x4003401C)
#define AD0DR4   (*(volatile unsigned int*)0x40034020)
#define AD0DR5   (*(volatile unsigned int*)0x40034024)
#define AD0DR6   (*(volatile unsigned int*)0x40034028)
#define AD0DR7   (*(volatile unsigned int*)0x4003402C)
#define AD0STAT  (*(volatile unsigned int*)0x40034030)
#define AD0TRM   (*(volatile unsigned int*)0x40034034)

/**************DAC**************/
#define DACR      (*(volatile unsigned int*)0x4008C000)
#define DACCTRL   (*(volatile unsigned int*)0x4008C004)
#define DACCNTVAL (*(volatile unsigned int*)0x4008C008)

