dylanwsmith/HOSS-Rover/Core Files/LPC1768regmap.h
/**************GPDMA**************/
// General Registers
#define DMACINTSTAT       (*(volatile unsigned int*)0x50004000)
#define DMACINTTCSTAT     (*(volatile unsigned int*)0x50004004)
#define DMACINTTCCLEAR    (*(volatile unsigned int*)0x50004008)
#define DMACIntErrStat    (*(volatile unsigned int*)0x5000400C)
#define DMACINTERRCLR     (*(volatile unsigned int*)0x50004010)
#define DMACRAWINTTCSTAT  (*(volatile unsigned int*)0x50004014)
#define DMACRAWINTERRSTAT (*(volatile unsigned int*)0x50004018)
#define DMACENBLDCHNS     (*(volatile unsigned int*)0x5000401C)
#define DMACSOFTBREQ      (*(volatile unsigned int*)0x50004020)
#define DMACSOFTSREQ      (*(volatile unsigned int*)0x50004024)
#define DMACSOFTLBREQ     (*(volatile unsigned int*)0x50004028)
#define DMACSOFTLSREQ     (*(volatile unsigned int*)0x5000402C)
#define DMACCONFIG        (*(volatile unsigned int*)0x50004030)
#define DMACSYNC          (*(volatile unsigned int*)0x50004034)
#define DMAREQSEL         (*(volatile unsigned int*)0x400FC1C4)
// Channel 0 Registers
#define DMACC0SRCADDR  (*(volatile unsigned int*)0x50004100)
#define DMACC0DESTADDR (*(volatile unsigned int*)0x50004104)
#define DMACC0LLI      (*(volatile unsigned int*)0x50004108)
#define DMACC0CONTROL  (*(volatile unsigned int*)0x5000410C)
#define DMACC0CONFIG   (*(volatile unsigned int*)0x50004110)
// Channel 1 Registers
#define DMACC1SRCADDR  (*(volatile unsigned int*)0x50004120)
#define DMACC1DESTADDR (*(volatile unsigned int*)0x50004124)
#define DMACC1LLI      (*(volatile unsigned int*)0x50004128)
#define DMACC1CONTROL  (*(volatile unsigned int*)0x5000412C)
#define DMACC1CONFIG   (*(volatile unsigned int*)0x50004130)
// Channel 2 Registers
#define DMACC2SRCADDR  (*(volatile unsigned int*)0x50004140)
#define DMACC2DESTADDR (*(volatile unsigned int*)0x50004144)
#define DMACC2LLI      (*(volatile unsigned int*)0x50004148)
#define DMACC2CONTROL  (*(volatile unsigned int*)0x5000414C)
#define DMACC2CONFIG   (*(volatile unsigned int*)0x50004150)
// Channel 3 Registers
#define DMACC3SRCADDR  (*(volatile unsigned int*)0x50004160)
#define DMACC3DESTADDR (*(volatile unsigned int*)0x50004164)
#define DMACC3LLI      (*(volatile unsigned int*)0x50004168)
#define DMACC3CONTROL  (*(volatile unsigned int*)0x5000416C)
#define DMACC3CONFIG   (*(volatile unsigned int*)0x50004170)
// Channel 4 Registers
#define DMACC4SRCADDR  (*(volatile unsigned int*)0x50004180)
#define DMACC4DESTADDR (*(volatile unsigned int*)0x50004184)
#define DMACC4LLI      (*(volatile unsigned int*)0x50004188)
#define DMACC4CONTROL  (*(volatile unsigned int*)0x5000418C)
#define DMACC4CONFIG   (*(volatile unsigned int*)0x50004190)
// Channel 5 Registers
#define DMACC5SRCADDR  (*(volatile unsigned int*)0x500041A0)
#define DMACC5DESTADDR (*(volatile unsigned int*)0x500041A4)
#define DMACC5LLI      (*(volatile unsigned int*)0x500041A8)
#define DMACC5CONTROL  (*(volatile unsigned int*)0x500041AC)
#define DMACC5CONFIG   (*(volatile unsigned int*)0x500041B0)
// Channel 6 Registers
#define DMACC6SRCADDR  (*(volatile unsigned int*)0x500041C0)
#define DMACC6DESTADDR (*(volatile unsigned int*)0x500041C4)
#define DMACC6LLI      (*(volatile unsigned int*)0x500041C8)
#define DMACC6CONTROL  (*(volatile unsigned int*)0x500041CC)
#define DMACC6CONFIG   (*(volatile unsigned int*)0x500041D0)
// Channel 7 Registers
#define DMACC7SRCADDR  (*(volatile unsigned int*)0x500041E0)
#define DMACC7DESTADDR (*(volatile unsigned int*)0x500041E4)
#define DMACC7LLI      (*(volatile unsigned int*)0x500041E8)
#define DMACC7CONTROL  (*(volatile unsigned int*)0x500041EC)
#define DMACC7CONFIG   (*(volatile unsigned int*)0x500041F0)

/**************Flash Memory**************/
// JTAG Flash
#define FMSSTART  (*(volatile unsigned int*)0x40084020)
#define FMSSTOP   (*(volatile unsigned int*)0x40084024)
#define FMSW0     (*(volatile unsigned int*)0x4008402C)
#define FMSW1     (*(volatile unsigned int*)0x40084030)
#define FMSW2     (*(volatile unsigned int*)0x40084034)
#define FMSW3     (*(volatile unsigned int*)0x40084038)
#define FMSTAT    (*(volatile unsigned int*)0x40084FE0)
#define FMSTATCLR (*(volatile unsigned int*)0x40084FE8)

/**************Debug Memory Re-mapping**************/
// Memory Mapping Control Register
#define MEMMAP (*(volatile unsigned int*)0x400FC040)

#endif
